import React from "react";
import NewsCard from "./common/NewsCard";
import newsimg from "../assets/images/pinpad.jpeg";
import newsimg1 from "../assets/images/_logo.png";
const News = () => {
  return (
    <React.Fragment>
      <div className="row newsTitle">اخبار و اطلاعات</div>
      <div className="appContainer p1 ">
        <div className="news ">
          <NewsCard
          //src={newsimg}
          //description="از آنجایی که طراحان عموما نویسنده متن نیستند و وظیفه رعایت حق تکثیر متون را ندارند و در همان حال کار آنها به نوعی وابسته به متن می‌باشد آنها با استفاده از محتویات ساختگی، صفحه گرافیکی خود را صفحه‌آرایی می‌کنند تا مرحله طراحی و صفحه‌بندی را به پایان برند"
          />
          <NewsCard
          //src={newsimg1}
          //description="از آنجایی که طراحان عموما نویسنده متن نیستند و وظیفه رعایت حق تکثیر متون را ندارند و در همان حال کار آنها به نوعی وابسته به متن می‌باشد آنها با استفاده از محتویات ساختگی، صفحه گرافیکی خود را صفحه‌آرایی می‌کنند تا مرحله طراحی و صفحه‌بندی را به پایان برند"
          />
          <NewsCard
          //src={newsimg}
          //description="از آنجایی که طراحان عموما نویسنده متن نیستند و وظیفه رعایت حق تکثیر متون را ندارند و در همان حال کار آنها به نوعی وابسته به متن می‌باشد آنها با استفاده از محتویات ساختگی، صفحه گرافیکی خود را صفحه‌آرایی می‌کنند تا مرحله طراحی و صفحه‌بندی را به پایان برند"
          />
          <NewsCard
          //src={newsimg}
          //description="از آنجایی که طراحان عموما نویسنده متن نیستند و وظیفه رعایت حق تکثیر متون را ندارند و در همان حال کار آنها به نوعی وابسته به متن می‌باشد آنها با استفاده از محتویات ساختگی، صفحه گرافیکی خود را صفحه‌آرایی می‌کنند تا مرحله طراحی و صفحه‌بندی را به پایان برند"
          />
        </div>
        <div className="archiveBtn">آرشیو</div>
      </div>
    </React.Fragment>
  );
};

export default News;
